HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxScu_regdef.h
/** \\brief  CCU Clock Control Register 2 */
typedef struct _Ifx_SCU_CCUCON2_Bits
{
    unsigned int BBBDIV:4;                  /**< \brief [3:0] BBB Divider Reload Value (rw) */
    unsigned int reserved_4:26;             /**< \brief \internal Reserved */
    unsigned int UP:1;                      /**< \brief [30:30] Update Request (w) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_CCUCON2_Bits;

/** \\brief  CCU Clock Control Register 3 */
typedef struct _Ifx_SCU_CCUCON3_Bits
{
    unsigned int PLLDIV:6;                  /**< \brief [5:0] PLL Divider Value (rw) */
    unsigned int PLLSEL:2;                  /**< \brief [7:6] PLL Target Monitoring Frequency Selection (rw) */
    unsigned int PLLERAYDIV:6;              /**< \brief [13:8] PLL_ERAY Divider Value (rw) */
    unsigned int PLLERAYSEL:2;              /**< \brief [15:14] PLL_ERAY Target Monitoring Frequency Selection (rw) */
    unsigned int SRIDIV:6;                  /**< \brief [21:16] SRI Divider Value (rw) */
    unsigned int SRISEL:2;                  /**< \brief [23:22] SRI Target Monitoring Frequency Selection (rw) */
    unsigned int reserved_24:5;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [29:29] Security Lock (rw) */
    unsigned int UP:1;                      /**< \brief [30:30] Update Request (w) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_CCUCON3_Bits;

/** \\brief  CCU Clock Control Register 4 */
typedef struct _Ifx_SCU_CCUCON4_Bits
{
    unsigned int SPBDIV:6;                  /**< \brief [5:0] SPB Divider Value (rw) */
    unsigned int SPBSEL:2;                  /**< \brief [7:6] SPB Target Monitoring Frequency Selection (rw) */
    unsigned int GTMDIV:6;                  /**< \brief [13:8] GTM Divider Value (rw) */
    unsigned int GTMSEL:2;                  /**< \brief [15:14] GTM Target Monitoring Frequency Selection (rw) */
    unsigned int STMDIV:6;                  /**< \brief [21:16] STM Divider Value (rw) */
    unsigned int STMSEL:2;                  /**< \brief [23:22] STM Target Monitoring Frequency Selection (rw) */
    unsigned int reserved_24:5;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [29:29] Security Lock (rw) */
    unsigned int UP:1;                      /**< \brief [30:30] Update Request (w) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_CCUCON4_Bits;

/** \\brief  CCU Clock Control Register 5 */
typedef struct _Ifx_SCU_CCUCON5_Bits
{
    unsigned int MAXDIV:4;                  /**< \brief [3:0] Max Divider Reload Value (rw) */
    unsigned int EBUDIV:4;                  /**< \brief [7:4] EBU Divider Reload Value (rw) */
    unsigned int reserved_8:22;             /**< \brief \internal Reserved */
    unsigned int UP:1;                      /**< \brief [30:30] Update Request (w) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_CCUCON5_Bits;

/** \\brief  CCU Clock Control Register 6 */
typedef struct _Ifx_SCU_CCUCON6_Bits
{
    unsigned int CPU0DIV:6;                 /**< \brief [5:0] CPU0 Divider Reload Value (rw) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_SCU_CCUCON6_Bits;

/** \\brief  CCU Clock Control Register 7 */
typedef struct _Ifx_SCU_CCUCON7_Bits
{
    unsigned int CPU1DIV:6;                 /**< \brief [5:0] CPU1 Divider Reload Value (rw) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_SCU_CCUCON7_Bits;

/** \\brief  CCU Clock Control Register 8 */
typedef struct _Ifx_SCU_CCUCON8_Bits
{
    unsigned int CPU2DIV:6;                 /**< \brief [5:0] CPU2 Divider Reload Value (rw) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_SCU_CCUCON8_Bits;

/** \\brief  CCU Clock Control Register 9 */
typedef struct _Ifx_SCU_CCUCON9_Bits
{
    unsigned int ADCDIV:6;                  /**< \brief [5:0] ADC Divider Value (rw) */
    unsigned int ADCSEL:2;                  /**< \brief [7:6] ADC Target Monitoring Frequency Selection (rw) */
    unsigned int reserved_8:21;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [29:29] Security Lock (rw) */
    unsigned int UP:1;                      /**< \brief [30:30] Update Request (w) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_CCUCON9_Bits;

/** \\brief  Chip Identification Register */
typedef struct _Ifx_SCU_CHIPID_Bits
{
    unsigned int CHREV:6;                   /**< \brief [5:0] Chip Revision Number (r) */
    unsigned int CHTEC:2;                   /**< \brief [7:6] Chip Family (r) */
    unsigned int CHID:8;                    /**< \brief [15:8] Chip Identification Number (rw) */
    unsigned int EEA:1;                     /**< \brief [16:16] Emulation Extension Available (rh) */
    unsigned int UCODE:7;                   /**< \brief [23:17] µCode Version (rw) */
    unsigned int FSIZE:4;                   /**< \brief [27:24] Program Flash Size (rw) */
    unsigned int SP:2;                      /**< \brief [29:28] Speed (rw) */
    unsigned int SEC:1;                     /**< \brief [30:30] Security Device (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_SCU_CHIPID_Bits;

/** \\brief  Die Temperature Sensor Control Register */
typedef struct _Ifx_SCU_DTSCON_Bits
{
    unsigned int PWD:1;                     /**< \brief [0:0] Sensor Power Down (rw) */
    unsigned int START:1;                   /**< \brief [1:1] Sensor Measurement Start (w) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int CAL:20;                    /**< \brief [23:4] Calibration Value (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [31:31] Security Lock (rw) */
} Ifx_SCU_DTSCON_Bits;

/** \\brief  Die Temperature Sensor Limit Register */
typedef struct _Ifx_SCU_DTSLIM_Bits
{
    unsigned int LOWER:10;                  /**< \brief [9:0] Lower Limit (rw) */
    unsigned int reserved_10:5;             /**< \brief \internal Reserved */
    unsigned int LLU:1;                     /**< \brief [15:15] Lower Limit Underflow (rwh) */
    unsigned int UPPER:10;                  /**< \brief [25:16] Upper Limit (rw) */
    unsigned int reserved_26:4;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] Security Lock (rw) */
    unsigned int UOF:1;                     /**< \brief [31:31] Upper Limit Overflow (rh) */
} Ifx_SCU_DTSLIM_Bits;

